Section6/app/Http/Controllers/ListingController.php

    public function index()
    {
        return inertia ('Listing/Index',
        [
            'listings'=> Listing::all()
        ]
    );
---
select * from `listings`